<?php

################## Translation For All Static Data ##################

return [
    'global' => [
        'site_name' => 'المتجر الاكتروني',
        'dashboard' => 'لوحة التحكم',
        'home' => 'الرئيسية',
        'roles' => 'الأدوار',
        'select_all' => 'تحديد الكل',
        'created_at' => 'تاريخ الانشاء',
        'email' => 'البريد الاكتروني',
        'password' => 'كلمة المرور',
        'password_confirmation' => 'تأكيد كلمة المرور',
        'phone' => 'رقم الهاتف',
        'status' => 'الحالة',
        'back_to_home' => 'الرجوع للصفحة الرئيسية',
        'no_items' => 'لا يوجد',
        'select' => 'اختار من هنا',

    ],
    'errors' => [
        '403' => 'عذرًا! ليس لديك صلاحية للوصول إلى هذه الصفحة.',
        '404' => 'عذرًا! الصفحة المطلوبة غير موجودة.',
        '500' => 'عذرًا! حدث خطأ في النظام. يُرجى المحاولة مرة أخرى.',
        '429' => 'عذرًا! تم إرسال عدد كبير جدًا من الطلبات. يُرجى المحاولة لاحقًا.',
        '419' => 'عذرًا! انتهت صلاحية الجلسة. يُرجى تحديث الصفحة والمحاولة مرة أخرى.',

    ],
    'actions' => [
        'title' => 'الإجراءات',
        'delete' => 'حذف',
        'edit' => 'تعديل',
        'show' => 'عرض',
        'save' => 'حفظ',
        'change_status' => 'تغيير الحالة',
    ],
    'status' => [
        'title' => 'الحالة',
        'active' => 'نشط',
        'inactive' => 'غير نشط'
    ],
    'authorization' => [
        'create_role' => 'إنشاء دور',
        'edit_role' => 'تعديل الدور',
        'role_name_ar' => 'اسم الدور بالعربية',
        'role_name_en' => 'اسم الدور بالانجليزية',
        'permassions' => 'الصلاحيات',
        'select_permassions' => 'تحديد الصلاحيات',
        'related_admins' => 'الحاصلين عليها',
        'create_new_role' => 'انشئ دور جديد',
    ],
    'admins' => [
        'title' => 'المسؤولين',
        'create_admin' => 'إنشاء مسؤول',
        'edit_admin' => 'تعديل المسؤول',
        'admin_name' => 'اسم المسؤول',
        'role' => 'الدور',
        'admin_name_ar' => 'اسم المسؤول بالعربية',
        'admin_name_en' => 'اسم المسؤول بالانجليزية',
        'create_new_admin' => 'انشئ مسؤول جديد',
    ],
];